Revit 2027 API
ViewPlan.GetViewRange Method
 Gets the view range.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PlanViewRange GetViewRange()
Public Function GetViewRange As PlanViewRange
public:
PlanViewRange^ GetViewRange()
member GetViewRange : unit -> PlanViewRange
Return Value
PlanViewRange
 The view range.
See Also
Reference
ViewPlan Class
Autodesk.Revit.DB Namespace